tap "bearer/tap"
tap "heroku/brew"
tap "reviewdog/tap"
brew "asdf"
brew "bash-completion"
brew "glib"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "curl"
brew "little-cms2"
brew "deno"
brew "gdbm"
brew "git"
brew "gnupg"
brew "jpeg-xl"
brew "libyaml"
brew "ncdu"
brew "ollama", restart_service: :changed
brew "openjdk"
brew "pnpm"
brew "postgresql@16"
brew "postgresql@18", restart_service: :changed, link: true
brew "pre-commit"
brew "pv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "redis"
brew "shared-mime-info"
brew "yarn"
brew "bearer/tap/bearer"
brew "heroku/brew/heroku"
brew "reviewdog/tap/reviewdog"
cask "claude-code"
cask "docker-desktop"
cask "iterm2"
cask "karabiner-elements"
cask "pgadmin4"
cask "session-manager-plugin"
cask "slack"
cask "visual-studio-code"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "jock.svg"
vscode "justusadam.language-haskell"
vscode "karunamurti.haml"
vscode "mechatroner.rainbow-csv"
vscode "mostafa.change-case"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "prisma.prisma"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "syler.sass-indented"
vscode "thenikso.github-plus-theme"
vscode "usernamehw.errorlens"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
