dbaeumer.vscode-eslint
docker.docker
donjayamanne.githistory
eamodio.gitlens
editorconfig.editorconfig
emmanuelbeziat.vscode-great-icons
esbenp.prettier-vscode
formulahendry.code-runner
github.copilot-chat
jock.svg
karunamurti.haml
mechatroner.rainbow-csv
mostafa.change-case
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-playwright.playwright
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.atom-keybindings
ms-vscode.remote-explorer
naumovs.color-highlight
prisma.prisma
thenikso.github-plus-theme
usernamehw.errorlens
wix.vscode-import-cost
xabikos.javascriptsnippets
yoavbls.pretty-ts-errors
